posts/applicative.org
#+SETUPFILE: ../org-templates/posts.org
#+MACRO: POST_TITLE Applicative
#+INCLUDE: ../org-templates/posts_header.org

/I've been learning about Haskell and Category Theory lately. In this/
/series of posts I hope to collect my thoughts. Please pop me an email or open a/
/pull request [[https://github.com/sevanspowell/sevanspowell][here]] if you want to make any suggestions/corrections, I'm still/
/learning myself./

In my last post, I talked about how a Functor allows you to apply a function
to values within the context of that Functor. In Haskell, this is implemented
by the ~fmap~ function:

#+BEGIN_SRC haskell
fmap :: Functor f => (a -> b) -> f a -> f b
#+END_SRC

An Applicative Functor is not all that different from a Functor, it still deals
with the application of a function to values within the context of a Functor,
but where that function /is itself/ in the context of a Functor. 

The minimal Applicative typeclass is defined as follows:

#+BEGIN_SRC haskell
class Functor f => Applicative f where
    pure :: a -> f a

    (<*>) :: f (a -> b) -> f a -> f b
#+END_SRC

As you can see, any data type that is an instance of Applicative must also be an
instance of Functor.

** Motivating Example

Alright, where are Applicative Functors useful though?

Let's say we have the following data type:

#+BEGIN_SRC haskell
data Address = Address { streetName :: String
                       , streetNum :: Integer
                       , isApartment :: Bool }
#+END_SRC

To construct an address, we need three things: a String value, an Integer value
and a Bool value. The constructing function has the following signature:

#+BEGIN_SRC haskell
Address :: String -> Integer -> Bool -> Address
#+END_SRC

Now, let's suppose we're parsing these addresses from some address book in a
text file and we have the following functions to retrieve the street name, street
number and apartment bool from the file:

#+BEGIN_SRC haskell
parseStreetName  :: File -> Maybe String
parseStreetNum   :: File -> Maybe Integer
parseIsApartment :: File -> Maybe Bool
#+END_SRC

Great! So we go ahead and try and parse our address:

#+BEGIN_SRC haskell
parseAddress :: File -> Address
parseAddress file = Address (parseStreetName file) (parseStreetNum file) (parseIsApartment file)
#+END_SRC

Oh no! That doesn't work, the ~parse~ functions return a Maybe type but the
~Address~ constructor function doesn't take Maybe types. The types don't line
up!

To solve this we could manually inspect the results of each parse function and
return a Maybe Address:

#+BEGIN_SRC haskell
parseAddress :: File -> Maybe Address
parseAddress file = maybeAddress (parseStreetName file) (parseStreetNum file) (parseIsApartment file)
  where
    maybeAddress :: Maybe String -> Maybe Integer -> Maybe Bool -> Maybe Address
    maybeAddress Nothing _ _ = Nothing
    maybeAddress _ Nothing _ = Nothing
    maybeAddress _ _ Nothing = Nothing
    maybeAddress street num apartment = Just (Address street num apartment)
#+END_SRC

That's certainly closer to what we want, but it's a little cumbersome to inspect
the results of the Maybe each time, surely there's a better way to do this.

Turns out, Applicative Functors can help us here:

#+BEGIN_SRC haskell
parseAddress :: File -> Maybe Address
parseAddress file = Address <$> parseStreetName file <*> parseStreetNum file <*> parseIsApartment file
#+END_SRC

Wow, that was easy! Let's take a moment to step through what's happening here:

According to precedence rules, the above statement happens in the following
order:

#+BEGIN_SRC haskell
(((Address <$> parseStreetName file) <*> parseStreetNum file) <*> parseIsApartment file)
#+END_SRC

