docs/posts/applicative.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Samuel Evans-Powell</title>
<!-- 2018-03-16 Fri 16:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Samuel Evans-Powell" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Samuel Evans-Powell</h1>
<p>
<a id="top" name="top"></a>
<a href="../index.html">&lt; Home</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Applicative</h2>
<div class="outline-text-2" id="text-1">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Applicative</a>
<ul>
<li><a href="#sec-1-1">Motivating Example</a></li>
<li><a href="#sec-1-2">&lt;$&gt; (fmap)</a></li>
<li><a href="#sec-1-3">&lt;*&gt; (apply)</a></li>
<li><a href="#sec-1-4">pure</a></li>
<li><a href="#sec-1-5">References</a></li>
</ul>
</li>
</ul>
</div>
</div>

<p>
<i>I've been learning about Haskell and Category Theory lately. In this</i>
<i>series of posts I hope to collect my thoughts. Please pop me an email or open a</i>
<i>pull request <a href="https://github.com/sevanspowell/sevanspowell">here</a> if you want to make any suggestions/corrections, I'm still</i>
<i>learning myself.</i>
</p>

<p>
In my last post, I talked about how a Functor allows you to apply a function
to values within the context of that Functor. In Haskell, this is implemented
by the <code>fmap</code> function:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">fmap</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Functor</span> f <span style="color: #715ab1;">=&gt;</span> (a <span style="color: #715ab1;">-&gt;</span> b) <span style="color: #715ab1;">-&gt;</span> f a <span style="color: #715ab1;">-&gt;</span> f b
</pre>
</div>

<p>
An Applicative Functor is not all that different from a Functor, it still deals
with the application of a function to values within the context of a Functor,
but where that function <i>is itself</i> in the context of a Functor. 
</p>

<p>
The minimal Applicative typeclass is defined as follows:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Functor</span> f <span style="color: #715ab1;">=&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Applicative</span> f <span style="color: #3a81c3; font-weight: bold;">where</span>
    pure <span style="color: #715ab1;">::</span> a <span style="color: #715ab1;">-&gt;</span> f a

    (<span style="color: #715ab1;">&lt;*&gt;</span>) <span style="color: #715ab1;">::</span> f (a <span style="color: #715ab1;">-&gt;</span> b) <span style="color: #715ab1;">-&gt;</span> f a <span style="color: #715ab1;">-&gt;</span> f b
</pre>
</div>

<p>
As you can see, any data type that is an instance of Applicative must also be an
instance of Functor.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Motivating Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Alright, where are Applicative Functors useful though?
</p>

<p>
Let's say we have the following data type:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">data</span> <span style="color: #ba2f59; font-weight: bold;">Address</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Address</span> { streetName <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">String</span>
                       , streetNum <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span>
                       , isApartment <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> }
</pre>
</div>

<p>
To construct an address, we need three things: a String value, an Integer value
and a Bool value. The constructing function has the following signature:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #ba2f59; font-weight: bold;">Address</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">String</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>
</pre>
</div>

<p>
Now, let's suppose we're parsing these addresses from some address book in a
text file and we have the following functions to retrieve the street name, street
number and apartment bool from the file:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">parseStreetName</span>  <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">File</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">String</span>
<span style="color: #6c3163; font-weight: bold;">parseStreetNum</span>   <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">File</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span>
<span style="color: #6c3163; font-weight: bold;">parseIsApartment</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">File</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span>
</pre>
</div>

<p>
Great! So we go ahead and try and parse our address:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">parseAddress</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">File</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>
<span style="color: #6c3163; font-weight: bold;">parseAddress</span> file <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Address</span> (parseStreetName file) (parseStreetNum file) (parseIsApartment file)
</pre>
</div>

<p>
Oh no! That doesn't work, the <code>parse</code> functions return a Maybe type but the
<code>Address</code> constructor function doesn't take Maybe types. The types don't line
up!
</p>

<p>
To solve this we could manually inspect the results of each parse function and
return a Maybe Address:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">parseAddress</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">File</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>
<span style="color: #6c3163; font-weight: bold;">parseAddress</span> file <span style="color: #715ab1;">=</span> maybeAddress (parseStreetName file) (parseStreetNum file) (parseIsApartment file)
  <span style="color: #3a81c3; font-weight: bold;">where</span>
    maybeAddress <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">String</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>
    maybeAddress <span style="color: #ba2f59; font-weight: bold;">Nothing</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Nothing</span>
    maybeAddress <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #ba2f59; font-weight: bold;">Nothing</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Nothing</span>
    maybeAddress <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #ba2f59; font-weight: bold;">Nothing</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Nothing</span>
    maybeAddress street num apartment <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Just</span> (<span style="color: #ba2f59; font-weight: bold;">Address</span> street num apartment)
</pre>
</div>

<p>
That's certainly closer to what we want, but it's a little cumbersome to inspect
the results of the Maybe each time, surely there's a better way to do this.
</p>

<p>
Turns out, Applicative Functors can help us here:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">parseAddress</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">File</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>
<span style="color: #6c3163; font-weight: bold;">parseAddress</span> file <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Address</span> <span style="color: #715ab1;">&lt;$&gt;</span> parseStreetName file <span style="color: #715ab1;">&lt;*&gt;</span> parseStreetNum file <span style="color: #715ab1;">&lt;*&gt;</span> parseIsApartment file
</pre>
</div>

<p>
Wow, that was easy! Let's take a moment to step through what's happening here:
</p>

<p>
According to precedence rules, the above statement happens in the following
order:
</p>

<div class="org-src-container">

<pre class="src src-haskell">(((<span style="color: #ba2f59; font-weight: bold;">Address</span> <span style="color: #715ab1;">&lt;$&gt;</span> parseStreetName file) <span style="color: #715ab1;">&lt;*&gt;</span> parseStreetNum file) <span style="color: #715ab1;">&lt;*&gt;</span> parseIsApartment file)
</pre>
</div>
</div>
</div>
