posts/applicative.org
** <$> (fmap)

Starting from the start:

#+BEGIN_SRC haskell
:: (String -> Integer -> Bool -> Address) -> Maybe String -> Maybe (Integer -> Bool -> Address)
(Address <$> parseStreetName file) :: Maybe (Integer -> Bool -> Address)
#+END_SRC

The Applicative type class necessitates that it's instances also be instances
of the Functor type class. So, Applicative instances can also use ~fmap~.

All we're doing is 'mapping' the ~Address~ function over the ~Maybe String~.
Because Maybe is an instance of Functor, it provides the ~fmap~ function
that allows us to do that. However, because not all the arguments of the Address
function are applied, we're left with:

#+BEGIN_SRC haskell
Maybe (Integer -> Bool -> Address)
#+END_SRC

We'd really like to just use the ~fmap~ function again to map this over the rest
of the results. However now the function itself is in the context of a Maybe
and so the ~fmap~ function is no longer useful. Fortunately, this is exactly
where Applicative Functors come in handy!

