docs/posts/applicative.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">&lt;$&gt; (fmap)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Starting from the start:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #715ab1;">::</span> (<span style="color: #ba2f59; font-weight: bold;">String</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>) <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">String</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>)
(<span style="color: #ba2f59; font-weight: bold;">Address</span> <span style="color: #715ab1;">&lt;$&gt;</span> parseStreetName file) <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>)
</pre>
</div>

<p>
The Applicative type class necessitates that it's instances also be instances
of the Functor type class. So, Applicative instances can also use <code>fmap</code>.
</p>

<p>
All we're doing is 'mapping' the <code>Address</code> function over the <code>Maybe String</code>.
Because Maybe is an instance of Functor, it provides the <code>fmap</code> function
that allows us to do that. However, because not all the arguments of the Address
function are applied, we're left with:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>)
</pre>
</div>

<p>
We'd really like to just use the <code>fmap</code> function again to map this over the rest
of the results. However now the function itself is in the context of a Maybe
and so the <code>fmap</code> function is no longer useful. Fortunately, this is exactly
where Applicative Functors come in handy!
</p>
</div>
</div>
