posts/applicative.org
** <*> (apply)

Remember I said Applicative Functors let us apply functions which are themselves
in the context of a Functor to values which are also in the context of a
Functor? This behaviour is provided by our ~(<*>)~ operator:

#+BEGIN_SRC haskell
(<*>) :: (Applicative f) => f (a -> b) -> f a -> f b
#+END_SRC

How will this help us? We had this:

#+BEGIN_SRC haskell
parseAddress :: File -> Maybe Address
parseAddress file = Address <$> parseStreetName file <*> parseStreetNum file <*> parseIsApartment file
#+END_SRC

But we've already resolved the first part:

#+BEGIN_SRC haskell
parseAddress :: File -> Maybe Address
parseAddress file = Maybe (Integer -> Bool -> Address) <*> parseStreetNum file <*> parseIsApartment file
#+END_SRC

Now we need to resolve the next part:

#+BEGIN_SRC haskell
Maybe (Integer -> Bool -> Address) <*> parseStreetNum file 
#+END_SRC

So the signature of the function we're looking for is:

#+BEGIN_SRC haskell
Maybe (Integer -> Bool -> Address) -> Maybe Integer -> Maybe (Bool -> Address)
#+END_SRC

In other words, it's applying the next argument of our Address constructor.

Starting with the definition of ~(<*>)~:

#+BEGIN_SRC haskell
(<*>) :: (Applicative f) => f (a -> b) -> f a -> f b
#+END_SRC

Let's try and match this signature to the signature we require. We'll start by
making the ~f~ a Maybe:

#+BEGIN_SRC haskell
(<*>) ::  Maybe (a -> b) -> Maybe a -> Maybe b
#+END_SRC

And make ~a~ an Integer:

#+BEGIN_SRC haskell
(<*>) ::  Maybe (Integer -> b) -> Maybe Integer -> Maybe b
#+END_SRC

And ~b~ a ~(Bool -> Address)~:

#+BEGIN_SRC haskell
(<*>) ::  Maybe (Integer -> Bool -> Address) -> Maybe Integer -> Maybe (Bool -> Address)
#+END_SRC

Sweet! Turns out the result of our ~apply~ operator will allow us to apply the
next argument of the function to a value within a Maybe context:

#+BEGIN_SRC haskell
:: Maybe (Integer -> Bool -> Address) -> Maybe Integer -> Maybe (Bool -> Address)
((Address <$> parseStreetName file) <*> parseStreetNum file) :: Maybe (Bool -> Address)
#+END_SRC

Now all we need to do is use the apply operator again to get our final result:

#+BEGIN_SRC haskell
(<*>) ::  Maybe (Bool -> Address) -> Maybe Bool -> Maybe Address
#+END_SRC

#+BEGIN_SRC haskell
:: Maybe (Bool -> Address) -> Maybe Bool -> Maybe Address
(((Address <$> parseStreetName file) <*> parseStreetNum file) <*> parseIsApartment file) :: Maybe Address
#+END_SRC

It takes a little to understand, but the code that uses Applictive Functors is
much less verbose. We use the properties of the Applicative to take care of
feeding possible failure from one function application to another. If all parse
functions succeed, a Just Address is returned. If any one fails, Nothing is
returned.

