docs/posts/applicative.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">&lt;*&gt; (apply)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Remember I said Applicative Functors let us apply functions which are themselves
in the context of a Functor to values which are also in the context of a
Functor? This behaviour is provided by our <code>(&lt;*&gt;)</code> operator:
</p>

<div class="org-src-container">

<pre class="src src-haskell">(<span style="color: #6c3163; font-weight: bold;">&lt;*&gt;</span>) <span style="color: #715ab1;">::</span> (<span style="color: #ba2f59; font-weight: bold;">Applicative</span> f) <span style="color: #715ab1;">=&gt;</span> f (a <span style="color: #715ab1;">-&gt;</span> b) <span style="color: #715ab1;">-&gt;</span> f a <span style="color: #715ab1;">-&gt;</span> f b
</pre>
</div>

<p>
How will this help us? We had this:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">parseAddress</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">File</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>
<span style="color: #6c3163; font-weight: bold;">parseAddress</span> file <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Address</span> <span style="color: #715ab1;">&lt;$&gt;</span> parseStreetName file <span style="color: #715ab1;">&lt;*&gt;</span> parseStreetNum file <span style="color: #715ab1;">&lt;*&gt;</span> parseIsApartment file
</pre>
</div>

<p>
But we've already resolved the first part:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">parseAddress</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">File</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>
<span style="color: #6c3163; font-weight: bold;">parseAddress</span> file <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>) <span style="color: #715ab1;">&lt;*&gt;</span> parseStreetNum file <span style="color: #715ab1;">&lt;*&gt;</span> parseIsApartment file
</pre>
</div>

<p>
Now we need to resolve the next part:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>) <span style="color: #715ab1;">&lt;*&gt;</span> parseStreetNum file
</pre>
</div>

<p>
So the signature of the function we're looking for is:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>) <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>)
</pre>
</div>

<p>
In other words, it's applying the next argument of our Address constructor.
</p>

<p>
Starting with the definition of <code>(&lt;*&gt;)</code>:
</p>

<div class="org-src-container">

<pre class="src src-haskell">(<span style="color: #6c3163; font-weight: bold;">&lt;*&gt;</span>) <span style="color: #715ab1;">::</span> (<span style="color: #ba2f59; font-weight: bold;">Applicative</span> f) <span style="color: #715ab1;">=&gt;</span> f (a <span style="color: #715ab1;">-&gt;</span> b) <span style="color: #715ab1;">-&gt;</span> f a <span style="color: #715ab1;">-&gt;</span> f b
</pre>
</div>

<p>
Let's try and match this signature to the signature we require. We'll start by
making the <code>f</code> a Maybe:
</p>

<div class="org-src-container">

<pre class="src src-haskell">(<span style="color: #6c3163; font-weight: bold;">&lt;*&gt;</span>) <span style="color: #715ab1;">::</span>  <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (a <span style="color: #715ab1;">-&gt;</span> b) <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> b
</pre>
</div>

<p>
And make <code>a</code> an Integer:
</p>

<div class="org-src-container">

<pre class="src src-haskell">(<span style="color: #6c3163; font-weight: bold;">&lt;*&gt;</span>) <span style="color: #715ab1;">::</span>  <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> b) <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> b
</pre>
</div>

<p>
And <code>b</code> a <code>(Bool -&gt; Address)</code>:
</p>

<div class="org-src-container">

<pre class="src src-haskell">(<span style="color: #6c3163; font-weight: bold;">&lt;*&gt;</span>) <span style="color: #715ab1;">::</span>  <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>) <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>)
</pre>
</div>

<p>
Sweet! Turns out the result of our <code>apply</code> operator will allow us to apply the
next argument of the function to a value within a Maybe context:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>) <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>)
((<span style="color: #ba2f59; font-weight: bold;">Address</span> <span style="color: #715ab1;">&lt;$&gt;</span> parseStreetName file) <span style="color: #715ab1;">&lt;*&gt;</span> parseStreetNum file) <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>)
</pre>
</div>

<p>
Now all we need to do is use the apply operator again to get our final result:
</p>

<div class="org-src-container">

<pre class="src src-haskell">(<span style="color: #6c3163; font-weight: bold;">&lt;*&gt;</span>) <span style="color: #715ab1;">::</span>  <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>) <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> (<span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>) <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>
(((<span style="color: #ba2f59; font-weight: bold;">Address</span> <span style="color: #715ab1;">&lt;$&gt;</span> parseStreetName file) <span style="color: #715ab1;">&lt;*&gt;</span> parseStreetNum file) <span style="color: #715ab1;">&lt;*&gt;</span> parseIsApartment file) <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>
</pre>
</div>

<p>
It takes a little to understand, but the code that uses Applictive Functors is
much less verbose. We use the properties of the Applicative to take care of
feeding possible failure from one function application to another. If all parse
functions succeed, a Just Address is returned. If any one fails, Nothing is
returned.
</p>
</div>
</div>
