posts/applicative.org
** pure

An Applicative instance must also implement the function 'pure':

#+BEGIN_SRC haskell
pure :: a -> f a
#+END_SRC

All pure does is 'lift' a value into the context of an Applicative.

For example:

#+BEGIN_SRC haskell
pure :: a -> Maybe a
pure x = Just x
#+END_SRC

#+BEGIN_SRC haskell
pure :: a -> [a]
pure x = [x]
#+END_SRC 

Where is this useful? When using an Applicative instance, you may come across
situations where you wish to apply a function within a Functor context to a
value which is not in that Functor.

For example, you may wish to apply a list of functions to a single value,
producing a new list of values, one element for the result of each function
being applied to the value:

#+BEGIN_SRC haskell
myFunc :: [(a -> b)] -> a -> [b]
#+END_SRC

The ~pure~ function allows you to 'lift' a value into the context of a *Functor*
(in this case a list):

#+BEGIN_SRC haskell
myFunc :: [(a -> b)] -> a -> [b]
myFunc fs a = fs <*> pure a
#+END_SRC

You may also wish to lift a function into the context of a Functor. We did this
in the Address examples using the ~(<$>)~ (fmap) operator, but it could also be
achieved using pure:

#+BEGIN_SRC haskell
parseAddress :: File -> Maybe Address
parseAddress file = pure Address <*> parseStreetName file <*> parseStreetNum file <*> parseIsApartment file
#+END_SRC

** References

http://www.seas.upenn.edu/%7Ecis194/spring13/lectures/10-applicative.html
http://wiki.ifs.hsr.ch/SemProgAnTr/files/ApplicativeFunctorsInHaskell.pdf
https://stackoverflow.com/questions/3242361/haskell-how-is-pronounced
