docs/posts/applicative.html

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">pure</h3>
<div class="outline-text-3" id="text-1-4">
<p>
An Applicative instance must also implement the function 'pure':
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">pure</span> <span style="color: #715ab1;">::</span> a <span style="color: #715ab1;">-&gt;</span> f a
</pre>
</div>

<p>
All pure does is 'lift' a value into the context of an Applicative.
</p>

<p>
For example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">pure</span> <span style="color: #715ab1;">::</span> a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> a
<span style="color: #6c3163; font-weight: bold;">pure</span> x <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Just</span> x
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">pure</span> <span style="color: #715ab1;">::</span> a <span style="color: #715ab1;">-&gt;</span> [a]
<span style="color: #6c3163; font-weight: bold;">pure</span> x <span style="color: #715ab1;">=</span> [x]
</pre>
</div>

<p>
Where is this useful? When using an Applicative instance, you may come across
situations where you wish to apply a function within a Functor context to a
value which is not in that Functor.
</p>

<p>
For example, you may wish to apply a list of functions to a single value,
producing a new list of values, one element for the result of each function
being applied to the value:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">myFunc</span> <span style="color: #715ab1;">::</span> [(a <span style="color: #715ab1;">-&gt;</span> b)] <span style="color: #715ab1;">-&gt;</span> a <span style="color: #715ab1;">-&gt;</span> [b]
</pre>
</div>

<p>
The <code>pure</code> function allows you to 'lift' a value into the context of a <b>Functor</b>
(in this case a list):
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">myFunc</span> <span style="color: #715ab1;">::</span> [(a <span style="color: #715ab1;">-&gt;</span> b)] <span style="color: #715ab1;">-&gt;</span> a <span style="color: #715ab1;">-&gt;</span> [b]
<span style="color: #6c3163; font-weight: bold;">myFunc</span> fs a <span style="color: #715ab1;">=</span> fs <span style="color: #715ab1;">&lt;*&gt;</span> pure a
</pre>
</div>

<p>
You may also wish to lift a function into the context of a Functor. We did this
in the Address examples using the <code>(&lt;$&gt;)</code> (fmap) operator, but it could also be
achieved using pure:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">parseAddress</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">File</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Address</span>
<span style="color: #6c3163; font-weight: bold;">parseAddress</span> file <span style="color: #715ab1;">=</span> pure <span style="color: #ba2f59; font-weight: bold;">Address</span> <span style="color: #715ab1;">&lt;*&gt;</span> parseStreetName file <span style="color: #715ab1;">&lt;*&gt;</span> parseStreetNum file <span style="color: #715ab1;">&lt;*&gt;</span> parseIsApartment file
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">References</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<a href="http://www.seas.upenn.edu/~cis194/spring13/lectures/10-applicative.html">http://www.seas.upenn.edu/~cis194/spring13/lectures/10-applicative.html</a>
<a href="http://wiki.ifs.hsr.ch/SemProgAnTr/files/ApplicativeFunctorsInHaskell.pdf">http://wiki.ifs.hsr.ch/SemProgAnTr/files/ApplicativeFunctorsInHaskell.pdf</a>
<a href="https://stackoverflow.com/questions/3242361/haskell-how-is-pronounced">https://stackoverflow.com/questions/3242361/haskell-how-is-pronounced</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Samuel Evans-Powell</p>
<p class="date">Created: 2018-03-16 Fri 16:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
